{"pageProps":{"project":{"title":"Aeon","displayTitle":"Aeon","summary":"A compact action game where you play as a fast and agile bird, dashing and striking to defeat towering rock golems, developed as a student project.","summaryVideo":{"name":"SnabbGrabbIntro","link":"/portfolio-website/media/aeon/Aeon_IntroVideo.mp4"},"introduction":"Aeon is a top-down, Diablo-style action game developed using TGE, the custom engine of The Game Assembly. The story follows a small hero navigating a world where time and space have been disrupted, requiring them to battle golems and overcome environmental obstacles. As a Gameplay and Tools Programmer, I focused on building the foundational movement and collision systems that defined the player experience within the engine.","introVideo":{"name":"Aeon Youtube Trailer","link":"https://www.youtube.com/embed/TWCVsLfUN20"},"devTime":"4 Weeks","engine":"TGE, C++","genre":"Top-down diablo-style action game","groupSize":12,"sections":[{"name":"Grid Collision and Level Design Tools","explenation":"The Grid Collision system was the backbone of all movement in Aeon, ensuring entities stayed within the boundaries of the game’s floating islands. To make the system accessible for the team, I implemented a simple tagging workflow that allowed level designers to apply collision logic to existing objects and change tiles during runtime. This focus on usability ensured that the technical constraints of the grid never hindered the creative process of level building.","video":{"name":"Fast AI","link":"/portfolio-website/media/aeon/Aeon_GridCol.mp4"}},{"name":"Player Movement and Navigation","explenation":"Building upon the grid system, I developed a movement set focused on fluidity and edge-case stability. My goal was to ensure that walking and dashing felt natural despite the strict underlying grid.","sections":[{"name":"One of the More Interesting Challenges: Stairs","explenation":"A specific challenge during development was how the player interacted with verticality. I implemented a system that utilized smooth lerping between height layers, but also accounted for side-approach logic. This allowed the player to take their first few steps onto a staircase from the side for a more natural feel, while preventing them from jumping up the entire height of the stairs from the side, which maintained the physical integrity of the level.","video":{"name":"Fast AI","link":"/portfolio-website/media/aeon/Aeon_PlayerMov.mp4"}},{"name":"Calculated Gaps and Dashing","explenation":"I designed the dash mechanic to allow for more than just horizontal movement. When a player attempts to dash over a gap, the system performs a series of point-checks in front of the character to validate potential landing spots. This ensures the player can only dash over empty space if there is a viable tile on the other side, preventing them from dashing into infinite voids while still allowing for aggressive, gap-clearing gameplay.","code":["INSERT CODE HERE"],"language":"tsx"}]},{"name":"CPU Particle System","explenation":"To enhance the visual feedback of the world, I created a lightweight, CPU-based particle system. While kept simple to maximize development efficiency, it was used effectively for entity trails and environmental destruction. Most importantly, it served a gameplay purpose by providing a clear visual indicator when an enemy noticed the player, bridging the gap between art and mechanical feedback.","video":{"name":"Fast AI","link":"/portfolio-website/media/aeon/Aeon_ParticleSys.mp4"}}]}},"__N_SSG":true}